Курсовая работа «Резервное копирование»
Возможна такая ситуация, что мы хотим показать друзьям фотографии из социальных сетей,
но соц. сети могут быть недоступны по каким-либо причинам. Давайте защитимся от такого.
Нужно написать программу для резервного копирования фотографий с профиля(аватарок) пользователя
vk в облачное хранилище Яндекс.Диск.
Для названий фотографий использовать количество лайков, если количество лайков одинаково,
то добавить дату загрузки.
Информацию по сохраненным фотографиям сохранить в json-файл.

Задание:
Нужно написать программу, которая будет:

Получать фотографии с профиля. Для этого нужно использовать метод photos.get.
Сохранять фотографии максимального размера(ширина/высота в пикселях) на Я.Диске.
Для имени фотографий использовать количество лайков.
Сохранять информацию по фотографиям в json-файл с результатами.
Обратите внимание: токен для ВК можно получить выполнив инструкцию.

Входные данные:
Пользователь вводит:

id пользователя vk;
токен с Полигона Яндекс.Диска. Важно: Токен публиковать в github не нужно!
Выходные данные:
json-файл с информацией по файлу:
    [{
    "file_name": "34.jpg",
    "size": "z"
    }]
Измененный Я.диск, куда добавились фотографии.​​
Обязательные требования к программе:
Использовать REST API Я.Диска и ключ, полученный с полигона.
Для загруженных фотографий нужно создать свою папку.
Сохранять указанное количество фотографий(по умолчанию 5) наибольшего размера
(ширина/высота в пикселях) на Я.Диске
Сделать прогресс-бар или логирование для отслеживания процесса программы.
Код программы должен удовлетворять PEP8.
У программы должен быть свой отдельный репозиторий.
Все зависимости должны быть указаны в файле requiremеnts.txt.​
Необязательные требования к программе:
Сохранять фотографии и из других альбомов.
Сохранять фотографии на Google.Drive.

РЕШЕНИЕ

import json
import os
import requests
import vk_api
from yandex_disk import YandexDisk

def main():
    # Вводим id пользователя vk и токен с Яндекс.Диска
    vk_user_id = input("Введите id пользователя вконтакте: ")
    yandex_disk_token = input("Введите токен Яндекс.Диска: ")

    # Авторизуемся в API VK
    vk_session = vk_api.VkApi(token='YOUR_TOKEN') # 'YOUR_TOKEN' заменить на токен ВК
    vk = vk_session.get_api()

    # Получаем список фотографий пользователя
    photos = vk.photos.get(owner_id=vk_user_id, album_id='profile', photo_sizes=1)['items']

    # Количество загружаемых фотографий
    count = min(len(photos), 5)

    # Авторизуемся в Яндекс.Диске
    disk = YandexDisk(token=yandex_disk_token)

    # Создаем папку
    folder_name = 'photos_from_vk'
    disk.mkdir(folder_name)

    # Загружаем фотографии
    for i in range(count):
        # Находим url фотографии максимального размера
        photo = sorted(photos[i]['sizes'], key=lambda x: x['width'], reverse=True)[0]
        url = photo['url']

        # Получаем данные о фотографии
        name = str(photos[i]['likes']['count']) + '.jpg'
        size = photo['type']
        width = photo['width']
        height = photo['height']

        # Сохраняем фотографию на Яндекс.Диск
        r = requests.get(url)
        if r.status_code == 200:
            disk.upload(r.content, folder_name + '/' + name)

        # Сохраняем информацию о фотографии в json-файл
        photo_info = {'file_name': name, 'size': size, 'width': width, 'height': height}
        with open('photos_info.json', 'a') as file:
            file.write(json.dumps(photo_info) + '\n')

    print('Готово!')

if __name__ == '__main__':
    main()
